lengxiaohua123/qemu_s32k348_source/hw/arm/s32k344evb.c
/*
 * QEMU S32K344EVB Board Implementation
 * Based on NXP S32K3xx Data Sheet Rev. 14 (April 2026)
 * Target: BCOM Motor Controller
 *
 * Functional peripherals (all visible/usable from the host):
 *   - 16x LPUART   (chardev backend: stdio/pty/tcp/usbserial adapter)
 *   - 6x  LPSPI    (QEMU SSI bus: attach ssi-loopback / spi-flash etc.)
 *   - 8x  FlexCAN  CAN 2.0B / CAN FD (QEMU CAN bus -> host SocketCAN /
 *                  TCP bridge to CAN tools on Windows)
 *   - SIUL2 GPIO   (512 qdev gpio lines, external-interrupt capable)
 *   - EMAC         (netdev backend: tap / socket / user)
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "system/address-spaces.h"
#include "qemu/units.h"
#include "qemu/error-report.h"
#include "qemu/log.h"
#include "qapi/error.h"
#include "qapi/visitor.h"
#include "hw/arm/s32k344evb.h"
/* s32k3_emios: 结构在 hw/timer/s32k3_emios.c 内（pwm-dump 经 QOM property 访问） */
#include "hw/misc/s32k3_clkgen.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-clock.h"
#include "hw/core/split-irq.h"
#include "hw/core/irq.h"
#include "hw/misc/unimp.h"
#include "hw/core/loader.h"
#include "hw/arm/boot.h"
#include "hw/arm/machines-qom.h"
#include "target/arm/cpu-qom.h"
#include "target/arm/cpu.h"
#include "system/system.h"
#include "system/reset.h"
#include "system/address-spaces.h"
#include "net/can_emu.h"
#include "hw/usb/usb.h"
#include "hw/usb/hcd-ehci.h"

/* ------------------------------------------------------------------
 *  Debug macro
 * ------------------------------------------------------------------ */
#define DB_PRINT(fmt, ...)                                                  \
    do {                                                                    \
        if (S32K344EVB_DEBUG) {                                             \
            qemu_log("S32K344EVB: " fmt "\n", ##__VA_ARGS__);               \
        }                                                                   \
    } while (0)

static bool S32K344EVB_DEBUG = false;

/* 加载从核固件到 SRAM（loader 因 ram_size=0 无法用，QOM 直接写）：
 * qom-set /machine core1-image /path/to/core1.bin（写 0x20444000） */
static void s32k344_core1_image_set(Object *obj, const char *value, Error **errp)
{
    uint8_t buf[8192];
    ssize_t n;
    int fd;

    fd = open(value, O_RDONLY);
    if (fd < 0) {
        error_setg(errp, "core1-image: cannot open %s", value);
        return;
    }
    n = read(fd, buf, sizeof(buf));
    close(fd);
    if (n <= 0) {
        error_setg(errp, "core1-image: empty file %s", value);
        return;
    }
    /* 写物理地址 0x20444000（SRAM1，从核区） */
    address_space_write(&address_space_memory, 0x20444000,
                        MEMTXATTRS_UNSPECIFIED, buf, n);
}

/* 释放 CM7_1 并设入口（真实 S32K3 由 CM7_0 写 MSCM/MC_ME 触发；
 * 测试接口：qom-set /machine release-core1 <入口地址>。
 * 从核栈取 SRAM 上沿 0x20445000（从核固件 _estack）。 */
static void s32k344_release_core1_set(Object *obj, Visitor *v,
                                      const char *name, void *opaque,
                                      Error **errp)
{
    CPUState *cpu1 = qemu_get_cpu(1);
    uint64_t entry = 0;

    if (!visit_type_uint64(v, name, &entry, errp)) {
        return;
    }
    if (entry && cpu1) {
        ARMCPU *arm = ARM_CPU(cpu1);
        cpu1->halted = false;
        arm->env.regs[13] = 0x20445000;   /* SP = 从核栈顶 */
        arm->env.regs[15] = entry;        /* PC = 从核入口 */
        arm->env.thumb = 1;
    }
}

/* CM7_1 复位后保持 halted（单核固件不释放从核） */
static void s32k344_halt_cm7_1(void *opaque)
{
    CPUState *cpu1 = qemu_get_cpu(1);

    if (cpu1) {
        cpu1->halted = true;
    }
}

static void s32k344evb_board_init(MachineState *machine);

/* ------------------------------------------------------------------
 *  Memory Region Helpers
 * ------------------------------------------------------------------ */
static void s32k348_create_ram_region(S32K344EVBMachineState *s,
                                      const char *name,
                                      hwaddr base, uint64_t size)
{
    MemoryRegion *ram = g_new(MemoryRegion, 1);
    memory_region_init_ram(ram, NULL, name, size, &error_fatal);
    memory_region_add_subregion(s->system_memory, base, ram);
    DB_PRINT("RAM region '%s' created: 0x%08" PRIx64 " - 0x%08" PRIx64,
             name, (uint64_t)base, (uint64_t)(base + size - 1));
}

/* ------------------------------------------------------------------
 *  LPUART x16 (functional)
 * ------------------------------------------------------------------ */
static void s32k348_uart_board_init(S32K344EVBMachineState *s)
{
    static const uint8_t lpuart_irq[S32K344_LPUART_INSTANCES] = {
        S32K344_IRQ_LPUART0,  S32K344_IRQ_LPUART1,  S32K344_IRQ_LPUART2,
        S32K344_IRQ_LPUART3,  S32K344_IRQ_LPUART4,  S32K344_IRQ_LPUART5,
        S32K344_IRQ_LPUART6,  S32K344_IRQ_LPUART7,  S32K344_IRQ_LPUART8,
        S32K344_IRQ_LPUART9,  S32K344_IRQ_LPUART10, S32K344_IRQ_LPUART11,
        S32K344_IRQ_LPUART12, S32K344_IRQ_LPUART13, S32K344_IRQ_LPUART14,
        S32K344_IRQ_LPUART15,
    };
    int i;

    for (i = 0; i < S32K344_LPUART_INSTANCES; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3_LPUART);
        SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
        Chardev *chr = serial_hd(i);
        Clock *uart_clk;
        hwaddr uart_base;

        s->uart[i] = S32K3_LPUART(dev);
        if (chr != NULL) {
            qdev_prop_set_chr(dev, "chardev", chr);
        }

        uart_clk = (i < 2 || i == 8) ? s->aips_plat_clk : s->aips_slow_clk;
        qdev_connect_clock_in(dev, "module_clk", uart_clk);
        qdev_prop_set_bit(dev, "lpuart_type", (i < 2) ? true : false);

        sysbus_realize(sbd, &error_fatal);

        if (i < 8) {
            uart_base = S32K344_LPUART0_BASE + S32K344_LPUART_OFFSET * i;
        } else {
            uart_base = S32K344_LPUART8_BASE + S32K344_LPUART_OFFSET * (i - 8);
        }
        sysbus_mmio_map(sbd, 0, uart_base);
        sysbus_connect_irq(sbd, 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m), lpuart_irq[i]));

