lengxiaohua123/qemu_s32k348_source/hw/arm/s32k344evb.c
        DB_PRINT("LPUART%d mapped @ 0x%08" PRIx64 " irq %d",
                 i, (uint64_t)uart_base, lpuart_irq[i]);
    }
}

/* ------------------------------------------------------------------
 *  LPSPI x6 (functional, SSI bus named "spi<N>")
 * ------------------------------------------------------------------ */
static void s32k348_spi_board_init(S32K344EVBMachineState *s)
{
    static const hwaddr spi_base[S32K344_LPSPI_INSTANCES] = {
        S32K344_LPSPI0_BASE, S32K344_LPSPI1_BASE, S32K344_LPSPI2_BASE,
        S32K344_LPSPI3_BASE, S32K344_LPSPI4_BASE, S32K344_LPSPI5_BASE,
    };
    static const uint8_t spi_irq[S32K344_LPSPI_INSTANCES] = {
        S32K344_IRQ_LPSPI0, S32K344_IRQ_LPSPI1, S32K344_IRQ_LPSPI2,
        S32K344_IRQ_LPSPI3, S32K344_IRQ_LPSPI4, S32K344_IRQ_LPSPI5,
    };
    int i;

    for (i = 0; i < S32K344_LPSPI_INSTANCES; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3_LPSPI);
        SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

        s->spi[i] = S32K3_LPSPI(dev);
        qdev_connect_clock_in(dev, "module_clk", s->aips_slow_clk);
        sysbus_realize(sbd, &error_fatal);
        sysbus_mmio_map(sbd, 0, spi_base[i]);
        sysbus_connect_irq(sbd, 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m), spi_irq[i]));

        DB_PRINT("LPSPI%d mapped @ 0x%08" PRIx64 " irq %d",
                 i, (uint64_t)spi_base[i], spi_irq[i]);

        if (i == 1) {
            /* LPSPI1：挂 GD3000 (MC33937) 预驱动从设备（BLDC 电机控制） */
            BusState *spi_bus = qdev_get_child_bus(dev, "spi");
            ssi_create_peripheral((SSIBus *)spi_bus, "s32k3-gd3000");
            DB_PRINT("GD3000 attached to LPSPI1");
        }
    }
}

/* ------------------------------------------------------------------
 *  FlexCAN x8 (functional CAN/CAN-FD; attach to host CAN buses)
 *
 *  Host side: create can-bus objects on the QEMU command line; the board
 *  wires FlexCAN0->canbus0 ... FlexCAN7->canbus7 when they exist:
 *
 *    -object can-bus,id=canbus0 \
 *    -object can-host-socketcan,if=can0,canbus=canbus0   (Linux)
 *
 *  or TCP bridge (works on Windows too):
 *    -object can-bus,id=canbus0 \
 *    -chardev socket,id=cansock0,host=127.0.0.1,port=29536,server=on,wait=off \
 *    -object can-host-socket,id=canhost0,canbus=canbus0,chardev=cansock0
 * ------------------------------------------------------------------ */
static void s32k348_can_board_init(S32K344EVBMachineState *s)
{
    static const hwaddr can_base[S32K344_FLEXCAN_INSTANCES] = {
        S32K344_FLEXCAN0_BASE, S32K344_FLEXCAN1_BASE,
        S32K344_FLEXCAN2_BASE, S32K344_FLEXCAN3_BASE,
        S32K344_FLEXCAN4_BASE, S32K344_FLEXCAN5_BASE,
        S32K344_FLEXCAN6_BASE, S32K344_FLEXCAN7_BASE,
    };
    static const uint8_t can_irq[S32K344_FLEXCAN_INSTANCES] = {
        S32K344_IRQ_FLEXCAN0, S32K344_IRQ_FLEXCAN1,
        S32K344_IRQ_FLEXCAN2, S32K344_IRQ_FLEXCAN3,
        S32K344_IRQ_FLEXCAN4, S32K344_IRQ_FLEXCAN5,
        S32K344_IRQ_FLEXCAN6, S32K344_IRQ_FLEXCAN7,
    };
    int i;

    for (i = 0; i < S32K344_FLEXCAN_INSTANCES; i++) {
        DeviceState *dev = qdev_new(TYPE_S32K3_FLEXCAN);
        SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
        char busname[16];
        Object *canbus_obj;

        s->can[i] = S32K3_FLEXCAN(dev);
        qdev_connect_clock_in(dev, "module_clk", s->aips_slow_clk);

        /* attach to host canbus<N> if the user created one */
        snprintf(busname, sizeof(busname), "canbus%d", i);
        canbus_obj = object_resolve_path_component(
            object_get_objects_root(), busname);
        if (canbus_obj) {
            object_property_set_link(OBJECT(dev), "canbus",
                                     canbus_obj, &error_fatal);
        } else if (i == 0) {
            /* default: private loopback bus so CAN works standalone.
             * CanBusState is a plain Object, not a Device.
             * NB: object_property_set_link() resolves the target's
             * canonical path, so the bus must be attached to a parent
             * (object_new() alone leaves it parentless and the link
             * silently fails in QEMU >= 8). */
            Object *bus = object_new(TYPE_CAN_BUS);
            object_property_add_child(OBJECT(s), "loopback-canbus0",
                                      bus);
            object_unref(bus);
            object_property_set_link(OBJECT(dev), "canbus",
                                     bus, &error_fatal);
        }

        sysbus_realize(sbd, &error_fatal);
        sysbus_mmio_map(sbd, 0, can_base[i]);
        sysbus_connect_irq(sbd, 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m), can_irq[i]));

        DB_PRINT("FlexCAN%d mapped @ 0x%08" PRIx64 " irq %d bus %s",
                 i, (uint64_t)can_base[i], can_irq[i],
                 canbus_obj ? busname : (i == 0 ? "(loopback)" : "(none)"));
    }
}

/* ------------------------------------------------------------------
 *  TEMPSENSE (temperature sensor calibration @ 0x4037C000)
 *  TCA0/1/2 出厂校准系数；模型用 25C 典型值（TCA0=25<<4 定点）。
 * ------------------------------------------------------------------ */
static uint64_t s32k348_tempsense_read(void *opaque, hwaddr offset,
                                       unsigned size)
{
    switch (offset) {
    case 0x08: return 25u << 4;   /* TCA0 */
    case 0x0C: return 0;          /* TCA1 */
    case 0x10: return 0;          /* TCA2 */
    default: return 0;
    }
}

static void s32k348_tempsense_write(void *opaque, hwaddr offset,
                                    uint64_t value, unsigned size)
{
    /* TCA 出厂校准只读 */
}

static const MemoryRegionOps s32k348_tempsense_ops = {
    .read = s32k348_tempsense_read,
    .write = s32k348_tempsense_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = { .min_access_size = 1, .max_access_size = 4 },
};

static void s32k348_tempsense_init(S32K344EVBMachineState *s)
{
    MemoryRegion *ts = g_new0(MemoryRegion, 1);

    memory_region_init_io(ts, NULL, &s32k348_tempsense_ops, NULL,
                          "s32k348.tempsense", 0x1000);
    memory_region_add_subregion(s->system_memory, 0x4037C000, ts);
}

/* ------------------------------------------------------------------
 *  SIUL2 GPIO (functional)
 * ------------------------------------------------------------------ */
/* 外部信号注入：qom-set /machine inject-ext-irq <pin>（0-7 = EIRQ0-7） */
/* timer 到期拉低：保持高电平跨 IFER 滤波两拍，确认上升沿 */
static void s32k348_inject_ext_irq_fall(void *opaque)
{
    S32K344EVBMachineState *s = opaque;

