lengxiaohua123/qemu_s32k348_source/hw/arm/s32k344evb.c
    if (s->inject_last_irq) {
        qemu_set_irq(s->inject_last_irq, 0);
        s->inject_last_irq = NULL;
    }
}

static void s32k348_inject_ext_irq_set(Object *obj, Visitor *v,
                                       const char *name, void *opaque,
                                       Error **errp)
{
    S32K344EVBMachineState *s = S32K344EVB_MACHINE(obj);
    uint32_t pin = 0;

    if (!visit_type_uint32(v, name, &pin, errp)) {
        return;
    }
    if (pin >= 8 || !s->siul2) {
        error_setg(errp, "inject-ext-irq: pin must be 0-7");
        return;
    }
    /* 拉高并保持 20us（SIUL2 滤波需两拍同电平确认沿） */
    qemu_irq in = qdev_get_gpio_in_named(DEVICE(s->siul2), "gpio-in", pin);
    qemu_set_irq(in, 1);
    s->inject_last_irq = in;
    timer_mod_ns(s->inject_timer,
                 qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 20000);
}

static void s32k348_inject_ext_irq_get(Object *obj, Visitor *v,
                                       const char *name, void *opaque,
                                       Error **errp)
{
    uint32_t val = 0;

    visit_type_uint32(v, name, &val, errp);
}

/* FlexCAN 注入：qom-set /machine inject-can "0x5165:!WAKEAPP"
 * （id 后跟 ':' + 最多 8 字节数据）。走模型接收路径，等价总线收帧。 */
static void s32k348_inject_can_set(Object *obj, const char *value, Error **errp)
{
    S32K344EVBMachineState *s = S32K344EVB_MACHINE(obj);
    uint32_t id;
    const char *d = NULL;
    uint8_t data[8] = { 0 };
    int dlc = 0;

    id = (uint32_t)strtoul(value, (char **)&d, 0);
    if (d && *d == ':') {
        d++;
        dlc = strlen(d);
        if (dlc > 8) {
            dlc = 8;
        }
        memcpy(data, d, dlc);
    }
    if (s->can[0]) {
        s32k3_flexcan_inject(s->can[0], id, data, dlc);
    }
}

/* ADC 模拟输入注入：qom-set /machine inject-adc-full <ch>（ADC2 通道，
 * 固件 TempSense 用 ADC2 ch0）。拉高 adc-in[ch] → ain=65535 →
 * 转换结果 0xFFF（满量程），验证固件读到的 ADC 采集值。 */
static void s32k348_inject_adc_full_set(Object *obj, Visitor *v,
                                        const char *name, void *opaque,
                                        Error **errp)
{
    S32K344EVBMachineState *s = S32K344EVB_MACHINE(obj);
    uint32_t ch = 0;

    if (!visit_type_uint32(v, name, &ch, errp)) {
        return;
    }
    if (ch >= 32 || !s->adc[2]) {
        error_setg(errp, "inject-adc-full: channel must be 0-31");
        return;
    }
    qemu_set_irq(qdev_get_gpio_in_named(s->adc[2], "adc-in", ch), 1);
}

/* PWM 占空比统计打印：qom-set /machine pwm-dump 0 */
static void s32k348_pwm_dump_set(Object *obj, Visitor *v,
                                 const char *name, void *opaque,
                                 Error **errp)
{
    S32K344EVBMachineState *s = S32K344EVB_MACHINE(obj);
    uint32_t dummy = 0;
    int inst;

    visit_type_uint32(v, name, &dummy, errp);
    for (inst = 0; inst < 3; inst++) {
        if (s->emios[inst]) {
            fprintf(stderr, "--- eMIOS%d PWM ---\n", inst);
            object_property_set_uint(OBJECT(s->emios[inst]), "pwm-dump",
                                     0, errp);
        }
    }
}

/* 霍尔信号注入：qom-set /machine inject-emios-edge <ch>（eMIOS1 通道）
 * 先拉高、timer 到期拉低 → 下降沿，触发 SAIC 输入捕获（EDPOL=1 时）。 */
static void s32k348_inject_emios_edge_set(Object *obj, Visitor *v,
                                          const char *name, void *opaque,
                                          Error **errp)
{
    S32K344EVBMachineState *s = S32K344EVB_MACHINE(obj);
    uint32_t ch = 0;

    if (!visit_type_uint32(v, name, &ch, errp)) {
        return;
    }
    if (ch >= 24 || !s->emios[1]) {
        error_setg(errp, "inject-emios-edge: channel must be 0-23");
        return;
    }
    qemu_irq in = qdev_get_gpio_in_named(s->emios[1], "input", ch);
    qemu_set_irq(in, 1);
    s->inject_last_irq = in;
    timer_mod_ns(s->inject_timer,
                 qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 10000);
}

static void s32k348_siul2_board_init(S32K344EVBMachineState *s)
{
    DeviceState *dev = qdev_new(TYPE_S32K3_SIUL2);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

    s->siul2 = S32K3_SIUL2(dev);
    qdev_connect_clock_in(dev, "module_clk", s->aips_plat_clk);
    sysbus_realize(sbd, &error_fatal);
    sysbus_mmio_map(sbd, 0, S32K344_SIUL2_BASE);
    sysbus_connect_irq(sbd, 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m),
                                        S32K344_IRQ_SIUL2_EIRQ0));
    for (int i = 1; i < 4; i++) {
        sysbus_connect_irq(sbd, i,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K344_IRQ_SIUL2_EIRQ0 + i));
    }
    DB_PRINT("SIUL2 mapped @ 0x%08x irq %d",
             S32K344_SIUL2_BASE, S32K344_IRQ_SIUL2_EIRQ0);

    /*
     * 外部信号注入接口：HMP/QMP `qom-set /machine inject-ext-irq <pin>`
     * 对 SIUL2 的 gpio-in 输入产生一个带滤波保持的上升沿，触发 EIRQ 外部中断
     * （固件须已配置 DIRER0/IREER0 对应 pin，如 BLDC 固件的 EIRQ7）。
     */
    s->inject_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL,
                                   s32k348_inject_ext_irq_fall, s);
    object_property_add(OBJECT(s), "inject-ext-irq", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_ext_irq_set, NULL, NULL);
    object_property_add(OBJECT(s), "inject-emios-edge", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_emios_edge_set, NULL, NULL);
    object_property_add(OBJECT(s), "pwm-dump", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_pwm_dump_set, NULL, NULL);
    object_property_add(OBJECT(s), "inject-adc-full", "uint32",
                        s32k348_inject_ext_irq_get,
                        s32k348_inject_adc_full_set, NULL, NULL);
    object_property_add_str(OBJECT(s), "inject-can",
                            NULL, s32k348_inject_can_set);
    object_property_add(OBJECT(s), "release-core1", "uint64",
                        NULL, s32k344_release_core1_set, NULL, NULL);
    object_property_add_str(OBJECT(s), "core1-image",
                            NULL, s32k344_core1_image_set);

    s32k348_tempsense_init(s);
}

/* ------------------------------------------------------------------
 *  EMAC (functional, netdev backend)
 * ------------------------------------------------------------------ */
static void s32k348_emac_board_init(S32K344EVBMachineState *s)
{
    DeviceState *dev = qdev_new(TYPE_S32K3_EMAC);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);

    s->emac = S32K3_EMAC(dev);
    qdev_connect_clock_in(dev, "module_clk", s->aips_plat_clk);
    /* QEMU 11: qemu_check_nic_model() is gone; use qemu_configure_nic_device(). */
    qemu_configure_nic_device(dev, true, NULL);
    sysbus_realize(sbd, &error_fatal);
    sysbus_mmio_map(sbd, 0, S32K344_EMAC_BASE);
    sysbus_connect_irq(sbd, 0,
                       qdev_get_gpio_in(DEVICE(&s->armv7m), S32K344_IRQ_EMAC));
    DB_PRINT("EMAC mapped @ 0x%08x irq %d",
             S32K344_EMAC_BASE, S32K344_IRQ_EMAC);
}

/* ------------------------------------------------------------------
 *  eDMA (native S32K3xx model, 32 channels)
 * ------------------------------------------------------------------ */
static void s32k348_dma_board_init(S32K344EVBMachineState *s)
{
    DeviceState *dev = qdev_new(TYPE_S32K3_EDMA);
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
    int i;

    s->dma = S32K3_EDMA(dev);
    qdev_connect_clock_in(dev, "module_clk", s->aips_slow_clk);
    object_property_set_link(OBJECT(s->dma), "memory",
                             OBJECT(s->system_memory), &error_fatal);
    sysbus_realize(sbd, &error_fatal);
    sysbus_mmio_map(sbd, 0, S32K344_EDMA_BASE);
    sysbus_mmio_map(sbd, 1, S32K344_EDMA_TCD1_BASE);
    sysbus_mmio_map(sbd, 2, S32K344_EDMA_TCD2_BASE);

    /* channel interrupts 0-31 */
    for (i = 0; i < S32K3_EDMA_CHANNELS; i++) {
        sysbus_connect_irq(sbd, i,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K344_IRQ_EDMA_CH0 + i));
    }
    /* 手册：eDMA 完成/错误共用通道中断（IRQ 4-35），无独立 error 线。
     * 模型 err_irq（index 32）不接 NVIC。 */

