lengxiaohua123/qemu_s32k348_source/hw/arm/s32k344evb.c
    /*
     * 9.7 USB host controller (EHCI)
     *
     * 注：S32K348 手册无 USB 外设（S32K3xx 系列无 USB），此 EHCI 为
     * 调试探针（s32k3-dap）虚拟总线，非真实芯片外设。保留但标注。
     * 挂载在 AIPS0 空闲槽位（非手册地址）。
     */
    {
        DeviceState *ehci = qdev_new(TYPE_PLATFORM_EHCI);
        sysbus_realize(SYS_BUS_DEVICE(ehci), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(ehci), 0, 0x40064000);
        DB_PRINT("USB EHCI (debug probe, NOT a real S32K348 peripheral) "
                 "mapped @ 0x40064000");
    }

    /* 10. Timers / ADC / I2C (functional models) */
    {
        /* PIT x3: 4 channels each on AIPS_SLOW_CLK (60 MHz).
         * S32K348 有 PIT0/1/2 三实例；每实例 4 通道共用一条 NVIC 线
         * （PIT0=IRQ96, PIT1=IRQ97, PIT2=IRQ98）。 */
        static const hwaddr pit_base[3] = {
            S32K344_PIT0_BASE, S32K344_PIT1_BASE, S32K344_PIT2_BASE,
        };
        static const uint8_t pit_irq[3] = {
            S32K344_IRQ_PIT0, S32K344_IRQ_PIT1, S32K344_IRQ_PIT2,
        };
        DeviceState *pit;
        int i;

        pit = qdev_new("s32k3-pit");
        s->pit = pit;
        qdev_connect_clock_in(pit, "module_clk", s->aips_slow_clk);
        sysbus_realize(SYS_BUS_DEVICE(pit), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(pit), 0, pit_base[0]);
        /* PIT0 ch0 经 split-irq 分扇到 NVIC + BCTU（见下），ch1..ch3 直连 */
        for (i = 1; i < 4; i++) {
            sysbus_connect_irq(SYS_BUS_DEVICE(pit), i,
                               qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                pit_irq[0]));
        }

        /* PIT1/PIT2：4 通道全部直连各自 NVIC 线 */
        for (i = 1; i < 3; i++) {
            DeviceState *pit_extra = qdev_new("s32k3-pit");
            int ch;
            qdev_connect_clock_in(pit_extra, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(pit_extra), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(pit_extra), 0, pit_base[i]);
            for (ch = 0; ch < 4; ch++) {
                sysbus_connect_irq(SYS_BUS_DEVICE(pit_extra), ch,
                                   qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                    pit_irq[i]));
            }
        }

        /* eMIOS x3: 24 channels each on AIPS_PLAT_CLK (240 MHz) */
        static const hwaddr emios_base[3] = {
            S32K344_EMIOS0_BASE, S32K344_EMIOS1_BASE, S32K344_EMIOS2_BASE,
        };
        static const uint8_t emios_irq[3] = {
            S32K344_IRQ_EMIOS0, S32K344_IRQ_EMIOS1, S32K344_IRQ_EMIOS2,
        };
        for (i = 0; i < 3; i++) {
            DeviceState *em = qdev_new("s32k3-emios");
            s->emios[i] = em;
            qdev_connect_clock_in(em, "module_clk", s->aips_plat_clk);
            sysbus_realize(SYS_BUS_DEVICE(em), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(em), 0, emios_base[i]);
            /* 模型内将 24 通道 flag OR 成 6 条 NVIC 线（ch23/19/15/11/7/3），
             * 即 sysbus irq 24-29（前 24 条是 per-channel irq） */
            for (int g = 0; g < 6; g++) {
                sysbus_connect_irq(SYS_BUS_DEVICE(em), g + 24,
                                   qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                    emios_irq[i] + g));
            }
        }

        /* ADC x3 on AIPS_PLAT_CLK */
        static const hwaddr adc_base[3] = {
            S32K344_ADC0_BASE, S32K344_ADC1_BASE, S32K344_ADC2_BASE,
        };
        static const uint8_t adc_irq[3] = {
            S32K344_IRQ_ADC0, S32K344_IRQ_ADC1, S32K344_IRQ_ADC2,
        };
        for (i = 0; i < 3; i++) {

            DeviceState *ad = qdev_new("s32k3-adc");


            s->adc[i] = ad;
            qdev_connect_clock_in(ad, "module_clk", s->aips_plat_clk);
            sysbus_realize(SYS_BUS_DEVICE(ad), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(ad), 0, adc_base[i]);
            sysbus_connect_irq(SYS_BUS_DEVICE(ad), 0,
                               qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                adc_irq[i]));
        }

        /* LPI2C x2 on AIPS_SLOW_CLK; bus names "i2c0"/"i2c1" */
        static const hwaddr i2c_base[S32K344_LPI2C_INSTANCES] = {
            S32K344_LPI2C0_BASE, S32K344_LPI2C1_BASE,
        };
        static const uint8_t i2c_irq[S32K344_LPI2C_INSTANCES] = {
            S32K344_IRQ_LPI2C0, S32K344_IRQ_LPI2C1,
        };
        for (i = 0; i < S32K344_LPI2C_INSTANCES; i++) {
            DeviceState *ic = qdev_new("s32k3-lpi2c");
            s->i2c[i] = ic;
            qdev_connect_clock_in(ic, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(ic), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(ic), 0, i2c_base[i]);
            sysbus_connect_irq(SYS_BUS_DEVICE(ic), 0,
                               qdev_get_gpio_in(DEVICE(&s->armv7m),
                                                i2c_irq[i]));
        }
    }

    /* 11. LCU x2 + BCTU with real trigger-chain wiring:
     *
     *   eMIOS0 ch0 flag -> LCU0 input0 -> LCU0 output0 -> BCTU trigger0
     *   PIT ch0 flag    --------------------------------> BCTU trigger1
     *   BCTU adc-trig[i] -------------------------------> ADC[i] hw-trig
     *
     * so firmware can build the classic motor-control chain
     * "PWM edge -> LCU logic -> BCTU -> ADC sample".
     */
    {
        DeviceState *lcu0, *lcu1, *bctu;

        /* LCU instances on AIPS_PLAT_CLK */
        lcu0 = qdev_new("s32k3-lcu");
        qdev_connect_clock_in(lcu0, "module_clk", s->aips_plat_clk);
        sysbus_realize(SYS_BUS_DEVICE(lcu0), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(lcu0), 0, S32K344_LCU0_BASE);
        sysbus_connect_irq(SYS_BUS_DEVICE(lcu0), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K344_IRQ_LCU0));
        s->lcu[0] = lcu0;

        lcu1 = qdev_new("s32k3-lcu");
        qdev_connect_clock_in(lcu1, "module_clk", s->aips_plat_clk);
        sysbus_realize(SYS_BUS_DEVICE(lcu1), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(lcu1), 0, S32K344_LCU1_BASE);
        sysbus_connect_irq(SYS_BUS_DEVICE(lcu1), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K344_IRQ_LCU1));
        s->lcu[1] = lcu1;

        /* BCTU on AIPS_PLAT_CLK */
        bctu = qdev_new("s32k3-bctu");
        qdev_connect_clock_in(bctu, "module_clk", s->aips_plat_clk);
        sysbus_realize(SYS_BUS_DEVICE(bctu), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(bctu), 0, S32K344_BCTU_BASE);
        sysbus_connect_irq(SYS_BUS_DEVICE(bctu), 0,
                           qdev_get_gpio_in(DEVICE(&s->armv7m),
                                            S32K344_IRQ_BCTU));
        s->bctu = bctu;

        /* trigger chain wiring */
        qdev_connect_gpio_out_named(s->emios[0], "pwm", 0,
                                    qdev_get_gpio_in_named(lcu0, "lc-in", 0));
        qdev_connect_gpio_out_named(lcu0, "lc-out", 0,
                                    qdev_get_gpio_in_named(bctu, "trig-in", 0));
        /* PIT ch0 -> NVIC (out 0) + BCTU trig 1 (out 1) via split-irq:
         * qdev GPIO outs are single links, so fan out before connecting. */
        DeviceState *pit_split = qdev_new(TYPE_SPLIT_IRQ);
        qdev_prop_set_uint32(pit_split, "num-lines", 2);
        qdev_realize_and_unref(pit_split, NULL, &error_fatal);
        sysbus_connect_irq(SYS_BUS_DEVICE(s->pit), 0,
                           qdev_get_gpio_in(DEVICE(pit_split), 0));
        qdev_connect_gpio_out(DEVICE(pit_split), 0,
                              qdev_get_gpio_in(DEVICE(&s->armv7m),
                                               S32K344_IRQ_PIT0));
        qdev_connect_gpio_out(DEVICE(pit_split), 1,
                              qdev_get_gpio_in_named(bctu, "trig-in", 1));

