lengxiaohua123/qemu_s32k348_source/hw/arm/s32k344evb.c
        /* BCTU -> ADC hardware triggers; ADC conv-done -> BCTU result */
        for (int i = 0; i < 3; i++) {
            qdev_connect_gpio_out_named(bctu, "adc-trig", i,
                                        qdev_get_gpio_in_named(s->adc[i],
                                                               "hw-trig", 0));
            qdev_connect_gpio_out_named(s->adc[i], "conv-done", 0,
                                        qdev_get_gpio_in_named(bctu,
                                                               "adc-done", i));
        }

        DB_PRINT("LCU0/LCU1/BCTU realized, trigger chain wired");
    }

    /* 12. Mode/Reset control blocks + SWT watchdog.
     *
     * FXOSC / PLL / MC_CGM 已在第 7 节作为真实时钟树创建；
     * 这里只补 MC_ME 与 MC_RGM（模式/复位状态）。
     */
    {
        /* MC_ME（模式状态） */
        DeviceState *mcme = qdev_new(TYPE_S32K3_CLKGEN);
        qdev_prop_set_uint32(mcme, "kind", CLKGEN_KIND_MC_ME);
        sysbus_realize(SYS_BUS_DEVICE(mcme), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(mcme), 0, S32K344_MCME_BASE);

        /* MC_RGM（复位状态）；复位事件 -> 请求 MC_CGM 切安全时钟 */
        DeviceState *mcrgm = qdev_new(TYPE_S32K3_CLKGEN);
        qdev_prop_set_uint32(mcrgm, "kind", CLKGEN_KIND_MC_RGM);
        sysbus_realize(SYS_BUS_DEVICE(mcrgm), &error_fatal);
        sysbus_mmio_map(SYS_BUS_DEVICE(mcrgm), 0, S32K344_MCRGM_BASE);
        sysbus_connect_irq(SYS_BUS_DEVICE(mcrgm), 0,
                           qdev_get_gpio_in_named(s->clkgen, "safe-sw", 0));

        /* PFLASH 控制器（PFC）：等待状态配置/锁寄存器 */
        {
            DeviceState *pfc = qdev_new("s32k3-pfc");
            qdev_connect_clock_in(pfc, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(pfc), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(pfc), 0, 0x40268000);
        }

        /* c40asf Flash 命令接口（FLASH0 @ 0x402EC000，RM 21.7.1.1） */
        {
            DeviceState *fl = qdev_new("s32k3-flash");
            qdev_connect_clock_in(fl, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(fl), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(fl), 0, 0x402EC000);
        }

        /* DMA Channel Multiplexer x2（RM 14 章） */
        {
            static const hwaddr dmamux_base[2] = {
                0x40280000, 0x40284000,
            };
            int di;
            for (di = 0; di < 2; di++) {
                DeviceState *dmx = qdev_new("s32k3-dmamux");
                qdev_connect_clock_in(dmx, "module_clk", s->aips_slow_clk);
                sysbus_realize(SYS_BUS_DEVICE(dmx), &error_fatal);
                sysbus_mmio_map(SYS_BUS_DEVICE(dmx), 0, dmamux_base[di]);
                /* DMAMUX0 输出 -> eDMA 请求输入（32 通道链路） */
                if (di == 0) {
                    for (int ci = 0; ci < 32; ci++) {
                        qdev_connect_gpio_out(dmx, ci,
                                              qdev_get_gpio_in(
                                                  DEVICE(s->dma), ci));
                    }
                }
            }
        }

        /* Messaging Unit x2（MU_0 用于 HSE_B，MU_1 @ AIPS2） */
        {
            static const hwaddr mu_base[2] = {
                0x4038C000, 0x404EC000,
            };
            int mi;
            for (mi = 0; mi < 2; mi++) {
                DeviceState *mu = qdev_new("s32k3-mu");
                qdev_connect_clock_in(mu, "module_clk", s->aips_slow_clk);
                sysbus_realize(SYS_BUS_DEVICE(mu), &error_fatal);
                sysbus_mmio_map(SYS_BUS_DEVICE(mu), 0, mu_base[mi]);
            }
        }

        /* Trigger MUX（RM 65 章，触发源选择） */
        {
            DeviceState *trg = qdev_new("s32k3-trgmux");
            qdev_connect_clock_in(trg, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(trg), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(trg), 0, 0x40080000);
        }

        /* FCCU（RM 52 章）+ XRDC（访问控制）占位 */
        {
            DeviceState *fccu = qdev_new("s32k3-fccu");
            qdev_prop_set_uint32(fccu, "kind", 0);   /* FCCU */
            qdev_connect_clock_in(fccu, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(fccu), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(fccu), 0, 0x40384000);

            DeviceState *xrdc = qdev_new("s32k3-fccu");
            qdev_prop_set_uint32(xrdc, "kind", 1);   /* XRDC */
            qdev_connect_clock_in(xrdc, "module_clk", s->aips_slow_clk);
            sysbus_realize(SYS_BUS_DEVICE(xrdc), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(xrdc), 0, 0x40278000);
        }

        /* STCU/MSCM/RTC/CRC 占位（s32k3-sysctl，kind 区分） */
        {
            static const struct {
                uint32_t kind;
                hwaddr base;
            } sysctl_blocks[] = {
                { 0, 0x403A0000 },   /* STCU */
                { 1, 0x40260000 },   /* MSCM */
                { 2, 0x40288000 },   /* RTC */
                { 3, 0x40380000 },   /* CRC */
            };
            int si;
            for (si = 0; si < (int)ARRAY_SIZE(sysctl_blocks); si++) {
                DeviceState *sc = qdev_new("s32k3-sysctl");
                qdev_prop_set_uint32(sc, "kind", sysctl_blocks[si].kind);
                qdev_connect_clock_in(sc, "module_clk", s->aips_slow_clk);
                sysbus_realize(SYS_BUS_DEVICE(sc), &error_fatal);
                sysbus_mmio_map(SYS_BUS_DEVICE(sc), 0, sysctl_blocks[si].base);
            }
        }

        /* SEMA42 信号量（RM 63：16 门 + GPR） */
        {
            DeviceState *sema = qdev_new("s32k3-sema42");
            sysbus_realize(SYS_BUS_DEVICE(sema), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(sema), 0, 0x40460000);
        }

        /* CONFIGURATION_GPR（RM：APP_CORE_ACC=5 允许应用核写） */
        {
            DeviceState *gpr = qdev_new("s32k3-sysctl");
            qdev_prop_set_uint32(gpr, "kind", 4);
            sysbus_realize(SYS_BUS_DEVICE(gpr), &error_fatal);
            sysbus_mmio_map(SYS_BUS_DEVICE(gpr), 0, 0x4039C000);
        }

